redis/results/results_blocksize/256B_port7010.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  60 secs]  0 threads 25 conns:    56611300 ops,  795337 (avg:  943211) ops/sec, 131.56MB/sec (avg: 155.64MB/sec), 22.01 (avg: 21.19) msec latency

16        Threads
25        Connections per thread
60        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       471610.57          ---          ---        21.19369        16.63900       148.47900       378.87900    139957.56 
Gets       471610.57      4131.32    467479.25        21.19369        16.63900       148.47900       378.87900     19416.54 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     943221.14      4131.32    467479.25        21.19369        16.63900       148.47900       378.87900    159374.10