redis/results/results_blocksize/4KB_port7008.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  60 secs]  0 threads 25 conns:    12595044 ops,  280940 (avg:  209807) ops/sec, 564.26MB/sec (avg: 420.83MB/sec), 71.33 (avg: 95.66) msec latency

16        Threads
25        Connections per thread
60        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       104775.40          ---          ---        95.65827        86.52700       362.49500       528.38300    424104.13 
Gets       104775.40       553.10    104222.29        95.65830        86.52700       362.49500       528.38300      6296.80 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     209550.79       553.10    104222.29        95.65828        86.52700       362.49500       528.38300    430400.93