redis/results/results_blocksize/4KB_port7024.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  60 secs]  0 threads 25 conns:    12676200 ops,  179458 (avg:  210829) ops/sec, 358.10MB/sec (avg: 422.86MB/sec), 96.98 (avg: 95.03) msec latency

16        Threads
25        Connections per thread
60        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       105242.16          ---          ---        95.03217        83.45500       368.63900       753.66300    425993.47 
Gets       105242.16       552.01    104690.16        95.03218        83.45500       368.63900       753.66300      6310.60 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     210484.33       552.01    104690.16        95.03218        83.45500       368.63900       753.66300    432304.07